ATsupportum/src/DataProcessors/ПодборСписаний_ат/ПодборСписаний_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПодборСписаний_ат</name>
</mdclass:DataProcessor>

ATsupportum/src/Documents/ОплатаПоставщику_ат/ОплатаПоставщику_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаПоставщику_ат</name>
  <registerRecords>AccumulationRegister.РасходыПоПоставщикам_ат</registerRecords>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>210</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

ATsupportum/src/Catalogs/Договоры_ат/Договоры_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Договоры_ат</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Контрагенты_ат</owners>
  <attributes>
    <name>Автопролонгация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>CatalogRef.ВидыДоговоров_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.ТипыОплатыПоДоговорам_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРасторжения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПостоплату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛимитСуммыПриПостоплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВнутреннее</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКраткое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноВнешнееСогласование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаявкаНаАрендуОборудования_ат</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>CatalogRef.Проекты_ат</types>
      <types>DocumentRef.ЗаявкаНаАрендуПП_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДанныхДляОпределенияТарифногоПлана</name>
    <type>
      <types>EnumRef.ПериодДанныхДляОпределенияТарифногоПлана_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьРеализаций</name>
    <type>
      <types>EnumRef.ПериодичностиРеализаций_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьСчетов</name>
    <type>
      <types>EnumRef.ПериодичностиСчетов_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ПостфиксНомера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксНомера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаРасторжения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РодДоговора</name>
    <type>
      <types>EnumRef.РодыДоговоров_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплатыВДнях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПодписанияРеализации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоговора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаРасчетаТарифногоПлана</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура_ат</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС_ат</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ATsupportum/src/DataProcessors/ПодборСписаний_ат/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПолучитьДанныеБухгалтерии(Команда)
	
	Списания.Очистить();
	
	Если ОбязательныеПоляЗаполнены() Тогда
		
		ПолучитьДанныеБухгалтерии_Сервер();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеБухгалтерии_Сервер()
	
	БазаДанных = Константы.БухгалтерияДляСинхронизации_ат.Получить();
	
	Если БазаДанных.Пустая() Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнена константа <Бухгалтерия Для Синхронизации>!";
		Сообщение.Сообщить(); 
		
		Возврат;
		
	КонецЕсли;
	
	ДанныеСинхронизацииОрганизации = СинхронизацияСБП_ат.ПолучитьСтруктуруДанныхСинхронизацииДляСсылки(
		Организация, "СинхронизацияОрганизаций_ат");
	Если ДанныеСинхронизацииОрганизации = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Указанная Организация не синхронизированна с выбранной ИБ Бухгалтерии Предприятия!";
		Сообщение.Сообщить(); 
		
		Возврат;
		
	КонецЕсли;
	
	ДанныеСинхронизацииКонтрагента = СинхронизацияСБП_ат.ПолучитьСтруктуруДанныхСинхронизацииДляСсылки(
		Поставщик, "СинхронизацияКонтрагентов_ат");
	Если ДанныеСинхронизацииКонтрагента = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Указанный Поставщик не синхронизирован с выбранной ИБ Бухгалтерии Предприятия!";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	Подключение = ПодключениеКИБ_ат.УстановитьПодключение(БазаДанных);
	Если ТипЗнч(Подключение) = Тип("Строка") Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Подключение;
		Сообщение.Сообщить(); 
		
		Возврат;
		
	КонецЕсли;
	
	ИдентификаторыКорректны = Истина;
	
	ОрганизацияБП = Подключение.Справочники.Организации.ПолучитьСсылку(
		Подключение.NewObject("УникальныйИдентификатор", ДанныеСинхронизацииОрганизации.Идентификатор));
	Если НЕ ЗначениеЗаполнено(ОрганизацияБП.Код) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Идентификатор синхронизированной Организации не корректен.";
		Сообщение.Сообщить();
		
		ИдентификаторыКорректны = Ложь;
		
	КонецЕсли;
	
	КонтрагентБП = Подключение.Справочники.Контрагенты.ПолучитьСсылку(
		Подключение.NewObject("УникальныйИдентификатор", ДанныеСинхронизацииКонтрагента.Идентификатор));
	Если НЕ ЗначениеЗаполнено(КонтрагентБП.Код) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Идентификатор синхронизированного Поставщика не корректен.";
		Сообщение.Сообщить();
		
		ИдентификаторыКорректны = Ложь;
		
	КонецЕсли;
	
	Если НЕ ИдентификаторыКорректны Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Подключение.NewObject("Запрос");
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СписаниеСРасчетногоСчета.Дата КАК ДатаДокумента,
		|	СписаниеСРасчетногоСчета.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
		|	СписаниеСРасчетногоСчета.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
		|	СписаниеСРасчетногоСчета.СуммаДокумента КАК СуммаДокумента,
		|	СписаниеСРасчетногоСчета.НазначениеПлатежа КАК НазначениеПлатежа,
		|	СписаниеСРасчетногоСчета.Комментарий КАК Комментарий
		|	ИЗ
		|		Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
		|	ГДЕ
		|		СписаниеСРасчетногоСчета.Проведен
		|		И СписаниеСРасчетногоСчета.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику)
		|		И ВЫБОР
		|				КОГДА &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА СписаниеСРасчетногоСчета.ДатаВходящегоДокумента >= &ДатаНачала
		|				ИНАЧЕ СписаниеСРасчетногоСчета.ДатаВходящегоДокумента МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			КОНЕЦ
		|		И СписаниеСРасчетногоСчета.Организация = &Организация
		|		И СписаниеСРасчетногоСчета.Контрагент = &Контрагент";
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", ОрганизацияБП);
	Запрос.УстановитьПараметр("Контрагент", КонтрагентБП);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Списание = Списания.Добавить();
		
		Списание.Организация 				= Организация;
		Списание.Поставщик 					= Поставщик;
		Списание.ДатаДокумента 				= Выборка.ДатаДокумента;
		Списание.НомерВходящегоДокумента 	= Выборка.НомерВходящегоДокумента;
		Списание.ДатаВходящегоДокумента 	= Выборка.ДатаВходящегоДокумента;
		Списание.СуммаДокумента 			= Выборка.СуммаДокумента;
		Списание.НазначениеПлатежа 			= Выборка.НазначениеПлатежа;
		Списание.Комментарий 				= Выборка.Комментарий;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция   ОбязательныеПоляЗаполнены()
	
	ПоляЗаполнены = Истина;
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнен Период.";
		Сообщение.Поле  = "Период";
		Сообщение.Сообщить(); 
		
		ПоляЗаполнены = Ложь;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнена Организация.";
		Сообщение.Поле  = "Организация";
		Сообщение.Сообщить();
		
		ПоляЗаполнены = Ложь;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Поставщик) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнен Поставщик.";
		Сообщение.Поле  = "Поставщик";
		Сообщение.Сообщить();
		
		ПоляЗаполнены = Ложь;
		
	КонецЕсли;
	
	Возврат ПоляЗаполнены;
	
КонецФункции

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	СоздатьДокументы_Сервер();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументы_Сервер()
	
	Если Списания.НайтиСтроки(Новый Структура("Договор", Справочники.Договоры_ат.ПустаяСсылка())).Количество() > 0 Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Договор указан не во всех списаниях.";
		Сообщение.Сообщить(); 
		
		Возврат;
		
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		
		Для Каждого Списание Из Списания Цикл
			
			ОплатаПоставщику = Документы.ОплатаПоставщику_ат.СоздатьДокумент();
			
			ОплатаПоставщику.Дата 						= Списание.ДатаДокумента;
			ОплатаПоставщику.Организация 				= Списание.Организация;
			ОплатаПоставщику.Поставщик 					= Списание.Поставщик;
			ОплатаПоставщику.Договор 					= Списание.Договор;
			ОплатаПоставщику.НомерВходящегоДокумента 	= Списание.НомерВходящегоДокумента;
			ОплатаПоставщику.ДатаВходящегоДокумента 	= Списание.ДатаВходящегоДокумента;
			ОплатаПоставщику.СуммаДокумента 			= Списание.СуммаДокумента;
			ОплатаПоставщику.НазначениеПлатежа 			= Списание.НазначениеПлатежа;
			
			ОплатаПоставщику.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			
			Сообщить("Создана " + ОплатаПоставщику);
			ЗаписьЖурналаРегистрации("Автосоздание документов.ОплатаПоставщику", УровеньЖурналаРегистрации.Информация,, ОплатаПоставщику.Ссылка, "Основание: " + Списание);
			
			Комментарии_ат.ДобавитьАвтокомментарийПоВиду(ОплатаПоставщику.Ссылка, Списание.Комментарий);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Ошибка = ОписаниеОшибки();
		Сообщить("Ошибка автосоздания ОплатаПоставщику по Списаниям: " + Ошибка);
		ЗаписьЖурналаРегистрации("Автосоздание документов.ОплатаПоставщику", УровеньЖурналаРегистрации.Ошибка,,, Ошибка);
		
	КонецПопытки;
	
КонецПроцедуры
